{"class_name": "Sequential", "config": [{"class_name": "Reshape", "config": {"target_shape": [1, 4], "batch_input_shape": [null, 4], "trainable": true, "name": "reshape_1", "input_dtype": "float32"}}, {"class_name": "LSTM", "config": {"U_regularizer": null, "name": "lstm_1", "inner_activation": "hard_sigmoid", "go_backwards": false, "activation": "tanh", "trainable": true, "unroll": false, "consume_less": "cpu", "stateful": false, "init": "glorot_uniform", "inner_init": "orthogonal", "dropout_U": 0.0, "dropout_W": 0.0, "input_dim": 4, "return_sequences": false, "b_regularizer": null, "W_regularizer": null, "output_dim": 3, "forget_bias_init": "one", "input_length": null}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_1", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "output_dim": 4}}]}